packages/core/src/external/carequality/ihe-gateway-v2/inbound/__tests__/xmls/epic-iti-38-request.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:urn1="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:urn2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
  <soap:Header>
    <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing" soap:mustUnderstand="1">https://sfd-np.et0121.epichosted.com:14430/interconnect-ce-env1/wcf/epic.community.hie/respondinggateway.svc/ceq</wsa:To>
    <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing" soap:mustUnderstand="1">urn:ihe:iti:2007:CrossGatewayQuery</wsa:Action>
    <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:0357bea4-617b-4a95-b631-03373250e78b</wsa:MessageID>
    <wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:xs="http://www.w3.org/2001/XMLSchema" ID="_9e3ff07a-31b6-4555-926c-509eb8e202d3" IssueInstant="2023-12-06T22:48:53.575Z" Version="2.0">
        <saml2:Issuer Format="urn:oasis:names:tc:SAML:1.1:nameid-format:emailAddress">support@metriport.com</saml2:Issuer>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#_9e3ff07a-31b6-4555-926c-509eb8e202d3">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                  <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xs"/>
                </ds:Transform>
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
              <ds:DigestValue>dXlGThCoETuHwnNgufmLmNOopHE=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>trNqcL35eCixmt0ldSAkQL+GgPB+n5FoAzB7fsAF+5aTRNFL+tCGTuzqqGotsX19+b9wSWN6nXCE7Txx4p9pHHo2xPPzoP4nLaoqqq5a1IuahLeL7cxcSbDn29In23l0asJzSHh75YxuNu47ACETmOGIYsNkP2bG0UD3zy2M0soU2VqDxwWFlcjJzZBKvZ5V1O0sBlswQphMr95RhQvQohR8SVPO9BVBZSoltxZ3rCaolhUFihs8yZ9bfJWL0jWQCX8y32O4EsPJwZGX8xdYuGgDn8NPvxS/nowL/4Iz7cUz0rz47XyB5n6HV1VH4NiFg1suJPjDKZJdIg/vbhtKCg==</ds:SignatureValue>
          <ds:KeyInfo>
            <ds:KeyValue>
              <ds:RSAKeyValue>
                <ds:Modulus>4tOa7loCPgXnfXjKJ1k+wWnb9EdZ3LV3J1CfO7Kg4r/1UDEsyg0zNW/D7KpgZIi9b4YWc2YC7LzD
Nnk1d4sB767rdMk0cIv4ysfpXOVyGFXF4RzoZcGxBU3ZhbqJybjtunDrmvA8NHymD4B/bz28sIVR
tJDV0H/g4I7jDNyCl6IUeQJKUTBa90UDdJgxFnMD0PmuxjA40injjZ707GuA+StggA0kGCIfhQEV
n1g7iL3O8zo9Yp0y3QkWtBgrxOTnI/1UPj6Sq0qBlD1C0obh327OJOMU9qLRrJLs6MIUzy7PeZLx
glQbCKX5zRhtEDe1G/FqQw/5zcxicBsgXtelMQ==</ds:Modulus>
                <ds:Exponent>AQAB</ds:Exponent>
              </ds:RSAKeyValue>
            </ds:KeyValue>
            <ds:X509Data>
              <ds:X509Certificate>MIIFHDCCBASgAwIBAgIIUbdr3gSmeh8wDQYJKoZIhvcNAQELBQAwgasxCzAJBgNVBAYTAlVTMRMw
EQYDVQQIDApDYWxpZm9ybmlhMRIwEAYDVQQHDAlTYW4gRGllZ28xEzARBgNVBAoMCkVNUiBEaXJl
Y3QxNjA0BgNVBAsMLUNlcnRpZmljYXRpb24gQXV0aG9yaXR5IChjZXJ0cy5lbXJkaXJlY3QuY29t
KTEmMCQGA1UEAwwdRU1SIERpcmVjdCBUZXN0IERldmljZSBTdWJDQTIwHhcNMjMxMTAyMjEyNTQy
WhcNMjQxMTAyMjEyNTQyWjB6MQswCQYDVQQGEwJVUzETMBEGA1UECAwKQ2FsaWZvcm5pYTEXMBUG
A1UECgwOTWV0cmlwb3J0IEluYy4xGTAXBgNVBAsMEENBUkVRVUFMSVRZLVRFU1QxIjAgBgNVBAMM
GWloZS5zdGFnaW5nLm1ldHJpcG9ydC5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
AQDi05ruWgI+Bed9eMonWT7Badv0R1nctXcnUJ87sqDiv/VQMSzKDTM1b8PsqmBkiL1vhhZzZgLs
vMM2eTV3iwHvrut0yTRwi/jKx+lc5XIYVcXhHOhlwbEFTdmFuonJuO26cOua8Dw0fKYPgH9vPbyw
hVG0kNXQf+DgjuMM3IKXohR5AkpRMFr3RQN0mDEWcwPQ+a7GMDjSKeONnvTsa4D5K2CADSQYIh+F
ARWfWDuIvc7zOj1inTLdCRa0GCvE5Ocj/VQ+PpKrSoGUPULShuHfbs4k4xT2otGskuzowhTPLs95
kvGCVBsIpfnNGG0QN7Ub8WpDD/nNzGJwGyBe16UxAgMBAAGjggFyMIIBbjBaBggrBgEFBQcBAQRO
MEwwSgYIKwYBBQUHMAKGPmh0dHA6Ly9jZXJ0cy5lbXJkaXJlY3QuY29tL2NlcnRzL0VNUkRpcmVj
dFRlc3REZXZpY2VTdWJDQTIuY3J0MB0GA1UdDgQWBBTHhH0qkOSuubx9pjHaChsgjBffJTAMBgNV
HRMBAf8EAjAAMB8GA1UdIwQYMBaAFLALWDvFk63Gb2VdEcASrVrch4Y1ME0GA1UdHwRGMEQwQqBA
oD6GPGh0dHA6Ly9jZXJ0cy5lbXJkaXJlY3QuY29tL2NybC9FTVJEaXJlY3RUZXN0RGV2aWNlU3Vi
Q0EyLmNybDAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMEQG
A1UdEQQ9MDuCGWloZS5zdGFnaW5nLm1ldHJpcG9ydC5jb22GHkhUVFA6Ly9XV1cuQ0FSRVFVQUxJ
VFkuT1JHL1YwMTANBgkqhkiG9w0BAQsFAAOCAQEACASUTJh9KQhdiksve1sR8cT/bB5Rn12qvlo3
6kNf0FvK6qxUY+bei3F1xeZ2X+2ALi88EypPwXH9N0CFsUNLG7twnjVtuIEPq/u6NU4dX55XdCIR
QcTjj6ctSLGoN1aNo2jBD/FtPScuTR95c/Gza43RTqJaPKrVnaWd9QA6TVSBimIodpYDz02ciM2v
889iK8HqYeGgk3m6SmAyliRQNcM1CM0dnjm3Jwa2dhHYtNNd0UUSd3mHAuqOTy9g9KBFp6pUVcVY
aDY9m0g9hmEBJqAR4Ua3PYudVAn5ibiu45fxXvfg8ewh9vviw/FPfjqIwEiNA53B24GPnkC9J/n2
Sw==</ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
        <saml2:Subject>
          <saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=ihe.staging.metriport.com,OU=CAREQUALITY-TEST,O=Metriport Inc.,ST=California,C=US</saml2:NameID>
          <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:holder-of-key">
            <saml2:SubjectConfirmationData>
              <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:KeyValue>
                  <ds:RSAKeyValue>
                    <ds:Modulus>4tOa7loCPgXnfXjKJ1k+wWnb9EdZ3LV3J1CfO7Kg4r/1UDEsyg0zNW/D7KpgZIi9b4YWc2YC7LzD
Nnk1d4sB767rdMk0cIv4ysfpXOVyGFXF4RzoZcGxBU3ZhbqJybjtunDrmvA8NHymD4B/bz28sIVR
tJDV0H/g4I7jDNyCl6IUeQJKUTBa90UDdJgxFnMD0PmuxjA40injjZ707GuA+StggA0kGCIfhQEV
n1g7iL3O8zo9Yp0y3QkWtBgrxOTnI/1UPj6Sq0qBlD1C0obh327OJOMU9qLRrJLs6MIUzy7PeZLx
glQbCKX5zRhtEDe1G/FqQw/5zcxicBsgXtelMQ==</ds:Modulus>
                    <ds:Exponent>AQAB</ds:Exponent>
                  </ds:RSAKeyValue>
                </ds:KeyValue>
                <ds:X509Data>
                  <ds:X509Certificate>MIIFHDCCBASgAwIBAgIIUbdr3gSmeh8wDQYJKoZIhvcNAQELBQAwgasxCzAJBgNVBAYTAlVTMRMw
EQYDVQQIDApDYWxpZm9ybmlhMRIwEAYDVQQHDAlTYW4gRGllZ28xEzARBgNVBAoMCkVNUiBEaXJl
Y3QxNjA0BgNVBAsMLUNlcnRpZmljYXRpb24gQXV0aG9yaXR5IChjZXJ0cy5lbXJkaXJlY3QuY29t
KTEmMCQGA1UEAwwdRU1SIERpcmVjdCBUZXN0IERldmljZSBTdWJDQTIwHhcNMjMxMTAyMjEyNTQy
WhcNMjQxMTAyMjEyNTQyWjB6MQswCQYDVQQGEwJVUzETMBEGA1UECAwKQ2FsaWZvcm5pYTEXMBUG
A1UECgwOTWV0cmlwb3J0IEluYy4xGTAXBgNVBAsMEENBUkVRVUFMSVRZLVRFU1QxIjAgBgNVBAMM
GWloZS5zdGFnaW5nLm1ldHJpcG9ydC5jb20wggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
AQDi05ruWgI+Bed9eMonWT7Badv0R1nctXcnUJ87sqDiv/VQMSzKDTM1b8PsqmBkiL1vhhZzZgLs
vMM2eTV3iwHvrut0yTRwi/jKx+lc5XIYVcXhHOhlwbEFTdmFuonJuO26cOua8Dw0fKYPgH9vPbyw
hVG0kNXQf+DgjuMM3IKXohR5AkpRMFr3RQN0mDEWcwPQ+a7GMDjSKeONnvTsa4D5K2CADSQYIh+F
ARWfWDuIvc7zOj1inTLdCRa0GCvE5Ocj/VQ+PpKrSoGUPULShuHfbs4k4xT2otGskuzowhTPLs95
kvGCVBsIpfnNGG0QN7Ub8WpDD/nNzGJwGyBe16UxAgMBAAGjggFyMIIBbjBaBggrBgEFBQcBAQRO
MEwwSgYIKwYBBQUHMAKGPmh0dHA6Ly9jZXJ0cy5lbXJkaXJlY3QuY29tL2NlcnRzL0VNUkRpcmVj
dFRlc3REZXZpY2VTdWJDQTIuY3J0MB0GA1UdDgQWBBTHhH0qkOSuubx9pjHaChsgjBffJTAMBgNV
HRMBAf8EAjAAMB8GA1UdIwQYMBaAFLALWDvFk63Gb2VdEcASrVrch4Y1ME0GA1UdHwRGMEQwQqBA
oD6GPGh0dHA6Ly9jZXJ0cy5lbXJkaXJlY3QuY29tL2NybC9FTVJEaXJlY3RUZXN0RGV2aWNlU3Vi
Q0EyLmNybDAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYwFAYIKwYBBQUHAwEGCCsGAQUFBwMCMEQG
A1UdEQQ9MDuCGWloZS5zdGFnaW5nLm1ldHJpcG9ydC5jb22GHkhUVFA6Ly9XV1cuQ0FSRVFVQUxJ
VFkuT1JHL1YwMTANBgkqhkiG9w0BAQsFAAOCAQEACASUTJh9KQhdiksve1sR8cT/bB5Rn12qvlo3
6kNf0FvK6qxUY+bei3F1xeZ2X+2ALi88EypPwXH9N0CFsUNLG7twnjVtuIEPq/u6NU4dX55XdCIR
QcTjj6ctSLGoN1aNo2jBD/FtPScuTR95c/Gza43RTqJaPKrVnaWd9QA6TVSBimIodpYDz02ciM2v
889iK8HqYeGgk3m6SmAyliRQNcM1CM0dnjm3Jwa2dhHYtNNd0UUSd3mHAuqOTy9g9KBFp6pUVcVY
aDY9m0g9hmEBJqAR4Ua3PYudVAn5ibiu45fxXvfg8ewh9vviw/FPfjqIwEiNA53B24GPnkC9J/n2
Sw==</ds:X509Certificate>
                </ds:X509Data>
              </ds:KeyInfo>
            </saml2:SubjectConfirmationData>
          </saml2:SubjectConfirmation>
        </saml2:Subject>
        <saml2:Conditions NotBefore="2023-12-06T22:48:53.575Z" NotOnOrAfter="2023-12-06T22:53:53.575Z">
          <saml2:AudienceRestriction>
            <saml2:Audience>https://sfd-np.et0121.epichosted.com:14430/interconnect-ce-env1/wcf/epic.community.hie/respondinggateway.svc/ceq</saml2:Audience>
          </saml2:AudienceRestriction>
        </saml2:Conditions>
        <saml2:AuthnStatement AuthnInstant="2023-12-06T22:48:53.576Z">
          <saml2:SubjectLocality Address="127.0.0.1" DNSName="localhost"/>
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:X509</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
        <saml2:AttributeStatement>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Administrator</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">Metriport</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.9621</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:nhin:names:saml:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xs:string">urn:oid:2.16.840.1.113883.3.9621</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue>
              <hl7:Role xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="224608005" codeSystem="2.16.840.1.113883.6.96" codeSystemName="SNOMED_CT" displayName="Administrator" xsi:type="hl7:CE"/>
            </saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue>
              <hl7:PurposeOfUse xmlns:hl7="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="TREATMENT" codeSystem="2.16.840.1.113883.3.18.7.1" codeSystemName="nhin-purpose" displayName="Treatment" xsi:type="hl7:CE"/>
            </saml2:AttributeValue>
          </saml2:Attribute>
        </saml2:AttributeStatement>
      </saml2:Assertion>
      <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
        <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
          <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
          <ds:Reference URI="#TS-90ed40de-e3ab-46be-b4ac-8a2b0ad4746a">
            <ds:Transforms>
              <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </ds:Transforms>
            <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <ds:DigestValue>PEL6iS5vnnktFrcXYeqwL29Sjek=</ds:DigestValue>
          </ds:Reference>
        </ds:SignedInfo>
        <ds:SignatureValue>sfpLW5RcDe7wyMwtDtuODO9WcXb9zfIPcF7qwpif3di2SWohlNfJBqxed1ERR1dbIHgZUfq8fBdPt8iGy+gAd9ET+lAm8uMqYT960AxbZomNxN0F+xzvN1MUoeH3bh1c0i+JaMVwTVEfsuHtgVzurVo7Pgg8gNfL8x0aEaQWdpxZA3hWIHPq70uLG5Ol9mBLOim4HYPV1I75e2riPO32RJkL3Q7hdvFBK+v3amIlLD5GeIkpwXwCd9qVGj+bhZgEbSwpl7As7LWC24IO9FZ1cX8MitJ0wQyJ1Nev30GGUegkmCxuLXpdFMnX2qZyS+H0xN1E2RvRvilNYkSmwFwDAg==</ds:SignatureValue>
        <ds:KeyInfo>
          <wsse:SecurityTokenReference xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0" wsu:Id="6a97dcbb-613a-4b4d-bad4-1615b87ce230">
            <wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLID">_9e3ff07a-31b6-4555-926c-509eb8e202d3</wsse:KeyIdentifier>
          </wsse:SecurityTokenReference>
        </ds:KeyInfo>
      </ds:Signature>
      <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-90ed40de-e3ab-46be-b4ac-8a2b0ad4746a">
        <wsu:Created>2023-12-06T22:47:13.577Z</wsu:Created>
        <wsu:Expires>2023-12-06T22:50:33.577Z</wsu:Expires>
      </wsu:Timestamp>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <urn:AdhocQueryRequest federated="false" id="0357bea4-617b-4a95-b631-03373250e78b" maxResults="-1" startIndex="0">
      <urn:ResponseOption returnComposedObjects="true" returnType="LeafClass"/>
      <urn2:AdhocQuery home="1.2.840.114350.1.13.11511.3.7.3.688884.100.1000" id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d" lid="urn:oasis:names:tc:ebxml-regrep:query:AdhocQueryRequest" objectType="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" status="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
        <urn2:Slot name="$XDSDocumentEntryPatientId" slotType="rim:StringValueType">
          <urn2:ValueList>
            <urn2:Value>'EV10045900^^^&amp;1.2.840.114350.1.13.11511.3.7.3.688884.100.1000&amp;ISO'</urn2:Value>
          </urn2:ValueList>
        </urn2:Slot>
        <urn2:Slot name="$XDSDocumentEntryStatus">
          <urn2:ValueList>
            <urn2:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</urn2:Value>
          </urn2:ValueList>
        </urn2:Slot>
        <urn2:Slot name="$XDSDocumentEntryCreationTimeFrom">
          <urn2:ValueList>
            <urn2:Value>20180101000000</urn2:Value>
          </urn2:ValueList>
        </urn2:Slot>
        <urn2:Slot name="$XDSDocumentEntryCreationTimeTo">
          <urn2:ValueList>
            <urn2:Value>20231201000000</urn2:Value>
          </urn2:ValueList>
        </urn2:Slot>
        <urn2:Slot name="$XDSDocumentEntryType">
          <urn2:ValueList>
            <urn2:Value>('urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1','urn:uuid:34268e47-fdf5-41a6-ba33-82133c465248')</urn2:Value>
          </urn2:ValueList>
        </urn2:Slot>
      </urn2:AdhocQuery>
    </urn:AdhocQueryRequest>
  </soap:Body>
</soap:Envelope>
