soap/src/main/java/gov/nist/toolkit/soap/http/sq1.txt


<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
 <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
   <wsa:To soapenv:mustUnderstand="true">http://localhost:5000/tf6/services/xdsregistryb</wsa:To>
   <wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:9283680F438B893A9C1303836858154</wsa:MessageID>
   <wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:RegistryStoredQuery</wsa:Action>
  </soapenv:Header>
  <soapenv:Body>
   <query:AdhocQueryRequest xmlns:query="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <query:ResponseOption returnComposedObjects="true" returnType="ObjectRef" />
                    <AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
                        <Slot name="$XDSDocumentEntryPatientId">
                            <ValueList>
                                <Value>'xxx'</Value>
                            </ValueList>
                        </Slot>
                        <Slot name="$XDSDocumentEntryStatus">
                            <ValueList>
                                <Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved', 'urn:oasis:names:tc:ebxml-regrep:StatusType:Deprecated')</Value>
                            </ValueList>
                        </Slot>
                    </AdhocQuery>
                </query:AdhocQueryRequest>
  </soapenv:Body>
</soapenv:Envelope>


